conf.org
*** task helper functions
These are the building blocks for skip functions.
#+BEGIN_SRC emacs-lisp
  (defun nd/is-todoitem-p ()
    "return todo keyword if present in headline (which defines the heading as a todoitem)
  this is used to both test if a heading is a todoitem and retrieving the keyword"
    (let ((keyword (nth 2 (org-heading-components))))
      (if (member keyword org-todo-keywords-1)
          keyword)))

  (defun nd/is-project-p ()
    "return todo keyword if heading is todoitem and has children"
    (and (nd/heading-has-children) (nd/is-todoitem-p)))

  (defun nd/is-task-p ()
    "return todo keyword if heading is todoitem with no children"
    (and (not (nd/heading-has-children)) (nd/is-todoitem-p)))

  (defun nd/is-atomic-task-p ()
    "return todo keyword if heading is task with no parents"
    (and (not (nd/heading-has-parent)) (nd/is-task-p)))
    
  (defun nd/is-project-task-p ()
    "return todo keyword if heading is task with no parents"
    (and (nd/heading-has-parent) (nd/is-task-p)))

  (defun nd/is-scheduled-heading-p ()
    "return timestamp if headline is scheduled"
    (org-entry-get nil "SCHEDULED"))

  (defun nd/is-series-header-p ()
    "return t if headline has property Project_Type=series"
    (equal "series" (org-entry-get nil "Project_Type")))

  (defun nd/is-closed-heading-p ()
    "return timestamp if headline is closed"
    (let ((timestamp (org-entry-get nil "CLOSED")))
      (if timestamp (float-time (date-to-time timestamp)))))

  (defvar nd/archive-delay-days 30
    "the number of days to wait before tasks show up in the archive view")

  (defun nd/is-archivable-heading-p ()
    "return timestamp if todoitem is closed and older than specified time"
    (let ((timestamp (nd/is-closed-heading-p)))
      ;; NOTE we do not ensure that the todo state is in done keywords
      ;; this is to allow easier error correction in slip functions
      (if (and timestamp (> (- (float-time) timestamp) (* 60 60 24 nd/archive-delay-days)))
          timestamp)))

  (defun nd/is-archivable-atomic-task-p ()
    "return keyword if heading is an archivable task"
    (and (nd/is-archivable-heading-p) (nd/is-atomic-task-p)))
    
  (defun nd/is-archivable-project-p ()
    "return keyword if heading is an archivable task"
    (and (nd/is-archivable-heading-p) (nd/is-project-p)))

  (defun nd/is-active-task-p ()
    "return keyword if task is either NEXT or scheduled"
    (let ((keyword (nd/is-task-p)))
      (if (or (equal keyword "NEXT") (nd/is-scheduled-heading-p))
          keyword)))

  (defun nd/is-blocked-task-p ()
    "return keyword if task is WAITING"
    (equal (nd/is-task-p) "WAITING"))

  (defun nd/heading-has-children ()
    "returns t if heading has todoitems in its immediate subtree"
    ;; TODO make this more efficient (and accurate) by only testing
    ;; the level immediately below (if it exists)
    (let ((has-children)
          (subtree-end (save-excursion (org-end-of-subtree t))))
      (save-excursion
        (outline-next-heading)
        (while (and (not has-children)
                    (< (point) subtree-end))
          (when (nd/is-todoitem-p)
            (setq has-children t))
  ;;        (org-forward-heading-same-level 1 t)))
          (outline-next-heading)))
      has-children))

  (defun nd/heading-has-parent ()
    "returns parent keyword if heading is in the immediate subtree of a todoitem"
    (save-excursion (and (org-up-heading-safe) (nd/is-todoitem-p))))

  (defun nd/is-discontinuous-project-task-p ()
    "detects todoitems that are children of non-todoitems
  that in turn are children of todoitems (discontinous project)"
    (let ((has-todoitem-parent)
          (has-non-todoitem-parent))
      (save-excursion
        (while (and (org-up-heading-safe)
                    (not has-todoitem-parent))
          (if (nd/is-todoitem-p)
              (setq has-todoitem-parent t)
            (setq has-non-todoitem-parent t))))
      (and has-todoitem-parent has-non-todoitem-parent)))

  (defconst nd/project-invalid-todostates
    '("WAITING" "NEXT")
    "projects cannot have these todostates") 

  ;; project level testing
  (defconst nd/project-statuscodes
    '(:archivable
      :complete
      :stuck
      :held
      :waiting
      :active
      :done-incomplete
      :undone-complete
      :undone-closed
      :done-unclosed
      :invalid-todostate
      :scheduled-project
      :discontinous)
    "list of statuscodes to be used in assessing projects
  Note they are listed in order of priority (eg items further
  down the list override higher items")

  (defmacro nd/compare-statuscodes (operator statuscode-1 statuscode-2)
    "syntactic suger to compare statuscodes by position"
    `(,operator (position ,statuscode-1 nd/project-statuscodes)
       (position ,statuscode-2 nd/project-statuscodes)))
    
  (defun nd/status< (statuscode-1 statuscode-2)
    "returns t is statuscode-1 is lesser priority than statuscode-2"
    (nd/compare-statuscodes < statuscode-1 statuscode-2))

  (defun nd/status> (statuscode-1 statuscode-2)
    "returns t is statuscode-1 is greater priority than statuscode-2"
    (nd/compare-statuscodes > statuscode-1 statuscode-2))

  (defun nd/status= (statuscode-1 statuscode-2)
    "returns t is statuscode-1 is equal priority than statuscode-2"
    (nd/compare-statuscodes = statuscode-1 statuscode-2))

  (defun nd/descend-into-project ()
    "returns statuscode of project and recursively descends into subprojects"
    (let ((project-state :archivable)
          (previous-point))
      (save-excursion
        (setq previous-point (point))
        (outline-next-heading)
        ;; loop breaks if active or higher priority
        ;; note that all invalid statuscodes are higher
        ;; thus this function will only return the first
        ;; encountered error
        (while (and (nd/status< project-state :active)
                    (> (point) previous-point))
          (let ((keyword (nd/is-todoitem-p)))
            (if keyword
                (let ((cur-state
                       (if (nd/heading-has-children)
                           (cond ((member keyword nd/project-invalid-todostates) :invalid-todostate)
                                 ((nd/is-scheduled-heading-p) :scheduled-project)
                                 ((equal keyword "CANCELLED") (if (nd/is-archivable-heading-p)
                                                                  :archivable
                                                                :complete))
                                 ((equal keyword "HOLD") :held)
                                 (t (let ((child-statuscode (nd/descend-into-project)))
                                      (cond ((equal keyword "TODO")
                                             (if (nd/status> child-statuscode :complete)
                                                 child-statuscode
                                               :undone-complete))
                                            (t (case child-statuscode
                                                 (:complete :complete)
                                                 (:archivable (if (nd/is-archivable-heading-p)
                                                                  :archivable
                                                                :complete))
                                                 (t (if (= child-statuscode :complete)
                                                        :complete
                                                      :done-imcomplete))))))))
                         (cond ((equal keyword "HOLD") :held)
                               ((equal keyword "WAITING") :waiting)
                               ((equal keyword "NEXT") :active)
                               ((and (equal keyword "TODO") (nd/is-scheduled-heading-p)) :active)
                               ((equal keyword "TODO") :stuck)
                               ((nd/is-archivable-heading-p) :archivable)
                               (t :complete)))))
                  (if (nd/status> cur-state project-state)
                      (setq project-state cur-state)))))
          (setq previous-point (point))
          (org-forward-heading-same-level 1 t)))
      project-state))

  (defun nd/is-project-status-p (statuscode)
    (let ((keyword (nd/is-project-p)))
      (if keyword
          (cond ((member keyword nd/project-invalid-todostates)
                 (if (nd/status= statuscode :invalid-todostate) keyword))
                ((equal keyword "HOLD") (if (nd/status= statuscode :held) keyword))
                ((equal keyword "CANCELLED") (if (nd/is-archivable-heading-p)
                                                 (if (nd/status= statuscode :archivable) keyword)
                                               (if (nd/status= statuscode :complete) keyword)))
                (t (let ((child-statuscode (nd/descend-into-project)))
                     (cond ((equal keyword "DONE")
                            (if (nd/is-archivable-heading-p)
                                ;; TODO make my statuscode condition checker handle multiples
                                (if (and (nd/status= statuscode :archivable)
                                         (nd/status= child-statuscode :archivable))
                                    keyword)
                              (if (and (nd/status= statuscode :complete)
                                       (nd/status= child-statuscode :complete))
                                  keyword
                                (if (and (nd/status> child-statuscode :complete)
                                         (nd/status= statuscode :done-incomplete))
                                    keyword))))
                           ((equal keyword "TODO")
                            (if (nd/status> child-statuscode :complete)
                                (if (nd/status= statuscode child-statuscode) keyword)
                              (if (nd/status= statuscode :undone-complete) keyword)))
                           (t (if (nd/status= statuscode child-statuscode) keyword)))))))))
#+END_SRC
