conf.el

;; TODO we could clean this up with macros
(defun nd/skip-non-atomic-tasks ()
  (save-restriction
    (widen)
    (if (not (nd/is-atomic-task-p))
        (save-excursion (or (outline-next-heading) (point-max))))))

(defun nd/skip-non-next-project-tasks ()
  (save-restriction
    (widen)
    ;; TODO skip over invalid and held
    (if (not (equal (nd/is-project-task-p) "NEXT"))
        (save-excursion (or (outline-next-heading) (point-max))))))
  
(defun nd/skip-non-waiting-project-tasks ()
  (save-restriction
    (widen)
    ;; TODO skip over invalid and held
    (if (not (equal (nd/is-project-task-p) "WAITING"))
        (save-excursion (or (outline-next-heading) (point-max))))))

(defun nd/skip-non-held-project-tasks ()
  (save-restriction
    (widen)
    ;; TODO skip over invalid and held
    (if (not (equal (nd/is-project-task-p) "HOLD"))
        (save-excursion (or (outline-next-heading) (point-max))))))
  
;; slip functions
(defun nd/skip-non-discontinuous-project-tasks ()
  (save-restriction
    (widen)
    (if (not (nd/is-discontinuous-project-task-p))
        (save-excursion (or (outline-next-heading) (point-max))))))

(defun nd/skip-non-done-open-todoitems ()
  (save-restriction
    (widen)
    (if (not (and (member (nd/is-todoitem-p) org-done-keywords) (not (nd/is-closed-heading-p))))
        (save-excursion (or (outline-next-heading) (point-max))))))
  
(defun nd/skip-non-undone-closed-todoitems ()
  (save-restriction
    (widen)
    (if (not (and (not (member (nd/is-todoitem-p)) org-done-keywords) (nd/is-closed-heading-p)))
        (save-excursion (or (outline-next-heading) (point-max))))))

;; projects
;; TODO skip entire subtree if we don't need to evaluate anything inside
;; otherwise (for example) a held project will still have it's subtasks show up
(defun nd/skip-projects-without-statuscode (statuscode)
  (save-restriction
    (widen)
    (if (not (nd/is-project-status-p statuscode))
        (save-excursion (or (outline-next-heading) (point-max))))))

;; top-level projects
(defun nd/skip-subprojects-without-statuscode (statuscode)
  (save-restriction
    (widen)
    (if (or (nd/heading-has-parent) (not (nd/is-project-status-p statuscode)))
        (save-excursion (or (outline-next-heading) (point-max))))))

(defun nd/skip-series-projects-without-statuscode (statuscode)
  (save-restriction
    (widen)
    (if (not (and (nd/is-series-heading-p) (nd/is-project-status-p statuscode)))
        (save-excursion (or (outline-next-heading) (point-max))))))
;; series projects
;; defined as project with property Project_type=series
;; must have:
;; - one level of subtasks
;; - all subtasks either TODO/scheduled, NEXT, DONE, CANCELLED
;; - at least one TODO/scheduled or NEXT (active) ..else empty
;; invalid if:
;; - project header is invalid project header (typical rules apply)

;; archiving
(defun nd/skip-non-archivable-atomic-tasks ()
  (save-restriction
    (widen)
    (if (not (nd/is-archivable-atomic-task-p))
        (save-excursion (or (outline-next-heading) (point-max))))))

(defvar nd/agenda-limit-project-toplevel t
  "used to filter projects by all levels or top-level only")

(defun nd/toggle-project-toplevel-display ()
  (interactive)
  (setq nd/agenda-limit-project-toplevel (not nd/agenda-limit-project-toplevel))
  (when  (equal major-mode 'org-agenda-mode)
    (org-agenda-redo))
  (message "Showing %s project view in agenda" (if nd/agenda-limit-project-toplevel "toplevel" "complete")))

(defun nd/agenda-base-task-command (keyword skip-fun)
  "shorter syntax to define task agenda commands"
  `(tags-todo
    "-NA-REFILE/!"
    ((org-agenda-overriding-header (concat ,keyword " Tasks"))
     (org-agenda-skip-function ,skip-fun)
     (org-agenda-todo-ignore-with-date 'all)
     (org-agenda-sorting-strategy '(category-keep)))))

(defun nd/agenda-base-project-command (match keyword statuscode)
  "shorter syntax to define project agenda commands"
  `(tags
    ,match
    ((org-agenda-overriding-header (concat
                                    (and nd/agenda-limit-project-toplevel "Toplevel ")
                                    ,keyword
                                    " Projects"))
     (org-agenda-skip-function (if nd/agenda-limit-project-toplevel
                                   '(nd/skip-subprojects-without-statuscode ,statuscode)
                                 '(nd/skip-projects-without-statuscode ,statuscode)))
     (org-agenda-sorting-strategy '(category-keep)))))

(setq org-agenda-tags-todo-honor-ignore-options t)
(setq org-agenda-custom-commands
      `(("t"
         "Task View"
         ((agenda "" nil)
          ,(nd/agenda-base-task-command "Next Project" ''nd/skip-non-next-project-tasks)
          ,(nd/agenda-base-task-command "Waiting Project" ''nd/skip-non-waiting-project-tasks)
          ,(nd/agenda-base-task-command "Atomic" ''nd/skip-non-atomic-tasks)
          ,(nd/agenda-base-task-command "Held Project" ''nd/skip-non-held-project-tasks)))
        ("o"
         "Project Overview"
         (,(nd/agenda-base-project-command "-NA-REFILE-ATOMIC-Project_Type=\"series\"/!" "Stuck" :stuck)
          ,(nd/agenda-base-project-command "-NA-REFILE-ATOMIC-Project_Type=\"series\"/!" "Waiting" :waiting)
          ,(nd/agenda-base-project-command "-NA-REFILE-ATOMIC-Project_Type=\"series\"/!" "Active" :active)
          ,(nd/agenda-base-project-command "-NA-REFILE-ATOMIC-Project_Type=\"series\"/!" "Held" :held)))
        ("r"
         "Refile and errors"
         ((tags "REFILE"
                ((org-agenda-overriding-header "Tasks to Refile"))
                (org-tags-match-list-sublevels nil))
          ,(nd/agenda-base-task-command "Discontinous Project" ''nd/skip-non-discontinuous-project-tasks)
          ,(nd/agenda-base-project-command "-NA-REFILE-ATOMIC-Project_Type=\"series\"/!" "Unmarked Completed" :complete)
          ,(nd/agenda-base-project-command "-NA-REFILE-ATOMIC-Project_Type=\"series\"/" "Invalid" :invalid-todostate)
          ;; ,(nd/agenda-base-task-command "Done But Not Closed" ''nd/skip-non-done-open-todoitems)
          ;; ,(nd/agenda-base-task-command "Closed But Not Done" ''nd/skip-non-open-closed-todoitems)
          ))
        ("s"
         "Series projects"
         (,(nd/agenda-base-project-command "-NA-REFILE-ATOMIC+Project_Type=\"series\"/!" "Active Series" :active)
          ,(nd/agenda-base-project-command "-NA-REFILE-ATOMIC+Project_Type=\"series\"/!" "Empty Series" :complete)))
        ("A"
         "Archivable Tasks and Projects"
         ((tags "-NA-REFILE/"
                ((org-agenda-overriding-header "Atomic Tasks to Archive")
                 (org-agenda-skip-function 'nd/skip-non-archivable-atomic-tasks)
                 (org-tags-match-list-sublevels nil)))
          ,(nd/agenda-base-project-command "-NA-REFILE-ATOMIC+Project_Type=\"series\"/!" "Archivable Series" :archivable)
          ,(nd/agenda-base-project-command "-NA-REFILE-ATOMIC/" "Archivable" :archivable)))))

(evil-define-key 'motion org-agenda-mode-map "T" 'nd/toggle-project-toplevel-display)

(setq org-agenda-span 'day)
(setq org-agenda-time-grid (quote ((daily today remove-match)
                                   #("----------------" 0 16 (org-heading t))
                                   (0900 1100 1300 1500 1700))))

(add-hook 'org-finalize-agenda-hook 'place-agenda-tags)
(defun place-agenda-tags ()
  "Put the agenda tags by the right border of the agenda window."
  (setq org-agenda-tags-column (- 4 (window-width)))
  (org-agenda-align-tags))
